app/views/devices/_form.html.erb

	  <!-- Esto es una prueba de comentarios -->
	  <%= f.association :location, collection: Location.orderdept, label_method: :department, value_method: :id, include_blank: false%>
---
SELECT  `locations`.* FROM `locations` ORDER BY `locations`.`id` ASC LIMIT 1