app/controllers/contracts_controller.rb

SELECT `contracts`.* FROM `contracts`
---
  def index
    @contracts = Contract.all