app/controllers/devices_controller.rb

  def index
    @devices = Device.all
---
SELECT `devices`.* FROM `devices`

  def create
    @device = Device.new(device_params)

    respond_to do |format|
      if @device.save
---
INSERT INTO `devices` (`name`, `unam_stock_number`, `location_id`, `created_at`, `updated_at`) VALUES ('Test 1', '123', 1, '2016-04-16 18:23:31', '2016-04-16 18:23:31')

  def destroy
    @device.destroy
---
DELETE FROM `devices` WHERE `devices`.`id` = 2

    def set_device
      @device = Device.find(params[:id])
---
SELECT  `devices`.* FROM `devices` WHERE `devices`.`id` = 2 LIMIT 1