app/controllers/locations_controller.rb

SELECT `locations`.* FROM `locations`
---
  def index
    @locations = Location.all

INSERT INTO `locations` (`department`, `responsable`, `email`, `created_at`, `updated_at`) VALUES ('Física', 'Chicharo Zavala', 'chicharo@dominio.com', '2016-04-16 18:22:57', '2016-04-16 18:22:57')
---
  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save

SELECT  `locations`.* FROM `locations` WHERE `locations`.`id` = 1 LIMIT 1
---
    def set_location
      @location = Location.find(params[:id])