app/controllers/renovations_controller.rb

SELECT `renovations`.* FROM `renovations`
---
  def index
    @renovations = Renovation.all