app/controllers/siteviews_controller.rb

  def index
    @siteviews = Siteview.all
---
SELECT `siteviews`.* FROM `siteviews`