app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `user_name`, `created_at`, `updated_at`) VALUES ('Juan Carlos', 'carlos@dominio.com', 'charly', '2016-04-30 17:42:43', '2016-04-30 17:42:43')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE `users` SET `name` = 'Alejandro López', `email` = 'lopez@mipagina.com', `updated_at` = '2016-04-30 18:39:00' WHERE `users`.`id` = 3
---
  def update
    respond_to do |format|
      if @user.update(user_params)